Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
09:47:33.255 INFO   Downloading Terraform configurations from file:///home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/17/default into /home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/17/default/.terragrunt-cache/taPxevW1G1I3JmXFhpbQyVNigOM/Mlplaatj-ONNhxKylvscs9fzDIU
09:47:33.451 STDOUT terraform: Initializing the backend...
09:47:33.577 STDOUT terraform: Successfully configured the backend "s3"! Terraform will automatically
09:47:33.577 STDOUT terraform: use this backend unless the backend configuration changes.
09:47:33.659 STDOUT terraform: Initializing provider plugins...
09:47:33.659 STDOUT terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
09:47:33.694 STDOUT terraform: - Reusing previous version of hashicorp/random from the dependency lock file
09:47:35.779 STDOUT terraform: - Using hashicorp/aws v5.69.0 from the shared cache directory
09:47:40.523 STDOUT terraform: - Using hashicorp/random v3.6.3 from the shared cache directory
09:47:40.630 STDOUT terraform: Terraform has been successfully initialized!
09:47:40.630 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
09:47:40.630 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
09:47:40.630 STDOUT terraform: should now work.
09:47:40.630 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
09:47:40.630 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
09:47:40.630 STDOUT terraform: commands will detect it and remind you to do so if necessary.
09:47:46.343 STDOUT terraform: random_pet.bucket_name: Refreshing state... [id=novel-ram]
09:47:46.624 STDOUT terraform: aws_s3_bucket.test_bucket: Refreshing state... [id=atlantis-terragrunt-test-novel-ram]
09:47:47.190 STDOUT terraform: Terraform used the selected providers to generate the following execution
09:47:47.190 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
09:47:47.190 STDOUT terraform: -/+ destroy and then create replacement
09:47:47.190 STDOUT terraform: Terraform will perform the following actions:
09:47:47.190 STDOUT terraform:   # aws_s3_bucket.test_bucket must be replaced
09:47:47.190 STDOUT terraform: -/+ resource "aws_s3_bucket" "test_bucket" {
09:47:47.191 STDOUT terraform:       + acceleration_status         = (known after apply)
09:47:47.191 STDOUT terraform:       + acl                         = (known after apply)
09:47:47.191 STDOUT terraform:       ~ arn                         = "arn:aws:s3:::atlantis-terragrunt-test-novel-ram" -> (known after apply)
09:47:47.191 STDOUT terraform:       ~ bucket                      = "atlantis-terragrunt-test-novel-ram" -> (known after apply) # forces replacement
09:47:47.191 STDOUT terraform:       ~ bucket_domain_name          = "atlantis-terragrunt-test-novel-ram.s3.amazonaws.com" -> (known after apply)
09:47:47.191 STDOUT terraform:       + bucket_prefix               = (known after apply)
09:47:47.191 STDOUT terraform:       ~ bucket_regional_domain_name = "atlantis-terragrunt-test-novel-ram.s3.ap-southeast-1.amazonaws.com" -> (known after apply)
09:47:47.191 STDOUT terraform:       ~ hosted_zone_id              = "Z3O0J2DXBE1FTB" -> (known after apply)
09:47:47.191 STDOUT terraform:       ~ id                          = "atlantis-terragrunt-test-novel-ram" -> (known after apply)
09:47:47.191 STDOUT terraform:       ~ object_lock_enabled         = false -> (known after apply)
09:47:47.191 STDOUT terraform:       + policy                      = (known after apply)
09:47:47.191 STDOUT terraform:       ~ region                      = "ap-southeast-1" -> (known after apply)
09:47:47.191 STDOUT terraform:       ~ request_payer               = "BucketOwner" -> (known after apply)
09:47:47.191 STDOUT terraform:       - tags                        = {} -> null
09:47:47.191 STDOUT terraform:       ~ tags_all                    = {} -> (known after apply)
09:47:47.191 STDOUT terraform:       + website_domain              = (known after apply)
09:47:47.191 STDOUT terraform:       + website_endpoint            = (known after apply)
09:47:47.191 STDOUT terraform:         # (1 unchanged attribute hidden)
09:47:47.191 STDOUT terraform:       ~ cors_rule (known after apply)
09:47:47.191 STDOUT terraform:       ~ grant (known after apply)
09:47:47.191 STDOUT terraform:       - grant {
09:47:47.191 STDOUT terraform:           - id          = "9f83ffd5bd78abb53e8b9de59f80f4efce23bffeeef98c1cab7e0b3e28cabbd4" -> null
09:47:47.191 STDOUT terraform:           - permissions = [
09:47:47.191 STDOUT terraform:               - "FULL_CONTROL",
09:47:47.191 STDOUT terraform:             ] -> null
09:47:47.191 STDOUT terraform:           - type        = "CanonicalUser" -> null
09:47:47.191 STDOUT terraform:             # (1 unchanged attribute hidden)
09:47:47.191 STDOUT terraform:         }
09:47:47.191 STDOUT terraform:       ~ lifecycle_rule (known after apply)
09:47:47.191 STDOUT terraform:       ~ logging (known after apply)
09:47:47.191 STDOUT terraform:       ~ object_lock_configuration (known after apply)
09:47:47.191 STDOUT terraform:       ~ replication_configuration (known after apply)
09:47:47.191 STDOUT terraform:       ~ server_side_encryption_configuration (known after apply)
09:47:47.191 STDOUT terraform:       - server_side_encryption_configuration {
09:47:47.191 STDOUT terraform:           - rule {
09:47:47.191 STDOUT terraform:               - bucket_key_enabled = false -> null
09:47:47.191 STDOUT terraform:               - apply_server_side_encryption_by_default {
09:47:47.191 STDOUT terraform:                   - sse_algorithm     = "AES256" -> null
09:47:47.191 STDOUT terraform:                     # (1 unchanged attribute hidden)
09:47:47.191 STDOUT terraform:                 }
09:47:47.191 STDOUT terraform:             }
09:47:47.191 STDOUT terraform:         }
09:47:47.191 STDOUT terraform:       ~ versioning (known after apply)
09:47:47.191 STDOUT terraform:       - versioning {
09:47:47.191 STDOUT terraform:           - enabled    = false -> null
09:47:47.191 STDOUT terraform:           - mfa_delete = false -> null
09:47:47.191 STDOUT terraform:         }
09:47:47.191 STDOUT terraform:       ~ website (known after apply)
09:47:47.191 STDOUT terraform:     }
09:47:47.191 STDOUT terraform:   # random_pet.bucket_name must be replaced
09:47:47.191 STDOUT terraform: -/+ resource "random_pet" "bucket_name" {
09:47:47.191 STDOUT terraform:       ~ id        = "novel-ram" -> (known after apply)
09:47:47.191 STDOUT terraform:       ~ length    = 2 -> 3 # forces replacement
09:47:47.191 STDOUT terraform:         # (1 unchanged attribute hidden)
09:47:47.191 STDOUT terraform:     }
09:47:47.191 STDOUT terraform: Plan: 2 to add, 0 to change, 2 to destroy.
09:47:47.191 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
09:47:47.191 STDOUT terraform: Saved the plan to:
09:47:47.191 STDOUT terraform: /home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/17/default/default.tfplan
09:47:47.191 STDOUT terraform: To perform exactly these actions, run the following command to apply:
09:47:47.191 STDOUT terraform:     terraform apply "/home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/17/default/default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://54.151.149.180:4141/lock?id=amitkarpe%252Fatlantis-test%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```